vke/nrf52840_dimmer_rgbw_zigbee/main.c
#include "sdk_config.h"
#include "zb_error_handler.h"
#include "zb_ha_dimmable_light.h"
#include "zb_mem_config_med.h"
#include "zb_nrf52840_internal.h"
#include "zboss_api.h"
#include "zigbee_helpers.h"

#include "zboss_api_af_addons.h"

#include "app_timer.h"
#include "boards.h"
#include "bsp.h"
#include "nrf_drv_pwm.h"

#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"

#define MAX_CHILDREN                 10                      // максимальное количество подключенных дочерних девайсов (для роутера)
#define IEEE_CHANNEL_MASK            (1l << ZIGBEE_CHANNEL)  // используемые каналы
#define HA_DIMMABLE_LIGHT_ENDPOINT_R 10                      // 4 эндпоинта для раздельного управления каждым из 4 цветов
#define HA_DIMMABLE_LIGHT_ENDPOINT_G 11                      //
#define HA_DIMMABLE_LIGHT_ENDPOINT_B 12                      //
#define HA_DIMMABLE_LIGHT_ENDPOINT_W 13                      //
#define ERASE_PERSISTENT_CONFIG      ZB_FALSE                // если установить в TRUE, то девайс будет с каждым включением всё забывать и спариваться заново.
#define DIMMER_PWM_INSTANCE          NRF_DRV_PWM_INSTANCE(0) // инстанс ШИМ, используемый девайсом
#define DIMMER_PWM_VALUE_MAX         256                     // настройки ШИМ, не вникал в них
#define DIMMER_PWM_VALUE_MIN         35                      // это вообще не используется, бездумно передрал с предыдущей

#define DIMMER_EFEKTA_BOARD_DBG      0                       // 1 - use on-board leds (debug mode), 0 - use gpio header (production mode)

#define BULB_INIT_BASIC_APP_VERSION   01                                  /**< Version of the application software (1 byte). */
#define BULB_INIT_BASIC_STACK_VERSION 10                                  /**< Version of the implementation of the ZigBee stack (1 byte). */
#define BULB_INIT_BASIC_HW_VERSION    11                                  /**< Version of the hardware of the device (1 byte). */
#define BULB_INIT_BASIC_MANUF_NAME    "mluvke"                            /**< Manufacturer name (32 bytes). */
#define BULB_INIT_BASIC_MODEL_ID      "RGBW Dimmer 1.2"                   /**< Model number assigned by manufacturer (32-bytes long string). */
#define BULB_INIT_BASIC_DATE_CODE     "20200211"                          /**< First 8 bytes specify the date of manufacturer of the device in ISO 8601 format (YYYYMMDD). The rest (8 bytes) are manufacturer specific. */
#define BULB_INIT_BASIC_POWER_SOURCE  ZB_ZCL_BASIC_POWER_SOURCE_DC_SOURCE /**< Type of power sources available for the device. For possible values see section 3.2.2.2.8 of ZCL specification. */
#define BULB_INIT_BASIC_LOCATION_DESC "Bedroom"                           /**< Describes the physical location of the device (16 bytes). May be modified during commisioning process. */
#define BULB_INIT_BASIC_PH_ENV        ZB_ZCL_BASIC_ENV_UNSPECIFIED        /**< Describes the type of physical environment. For possible values see section 3.2.2.2.10 of ZCL specification. */

#define IDENTIFY_MODE_ENTER_BUTTON BSP_BOARD_BUTTON_0 // номер кнопки спаривания устройств в списке BUTTONS_LIST в файле описания платы
#define ZIGBEE_NETWORK_STATE_LED   BSP_BOARD_LED_0    // номер светодиода состояния подключения в списке LEDS_LIST в файле описания платы

// пины, используемые под каждый из 4 цветов.
// LED2_Dx задаются в файле описания платы (efekta_dev_board.h),
// файл инклудится через дефайн CUSTOM_BOARD_INC в настройках проекта (+ дефайн BOARD_EFEKTA_MINI_DEV_BOARD)
#if DIMMER_EFEKTA_BOARD_DBG
#define DIMMER_CHANNEL_PIN_R LED2_R // pwm channel 0
#define DIMMER_CHANNEL_PIN_G LED2_G // pwm channel 1
#define DIMMER_CHANNEL_PIN_B LED2_B // pwm channel 2
#define DIMMER_CHANNEL_PIN_W LED2_DW // pwm channel 3
#define DIMMER_PWM_INVERSION 0
#else // DIMMER_EFEKTA_BOARD_DBG
#define DIMMER_CHANNEL_PIN_R LED2_DR // pwm channel 0
#define DIMMER_CHANNEL_PIN_G LED2_DG // pwm channel 1
#define DIMMER_CHANNEL_PIN_B LED2_DB // pwm channel 2
#define DIMMER_CHANNEL_PIN_W LED2_DW // pwm channel 3
#define DIMMER_PWM_INVERSION NRF_DRV_PWM_PIN_INVERTED
#endif // DIMMER_EFEKTA_BOARD_DBG

// настройки ШИМ, не вникал, т.к. работает само из коробки.
static nrf_drv_pwm_t m_led_pwm = DIMMER_PWM_INSTANCE; // инстанс ШИМ
static nrf_pwm_values_individual_t m_led_values; // массив из 4 яркостей для каждого из 4 светодиодов
static nrf_pwm_sequence_t const m_led_seq =
{
        .values.p_individual = &m_led_values,
        .length = NRF_PWM_VALUES_LENGTH(m_led_values),
        .repeats = 0,
        .end_delay = 0
};

// макрос, используемый для заполнения структуры в памяти под "простое" описание эндпоинта, когда эндпоинтов несколько.
#define ZB_ZCL_DECLARE_HA_DIMMABLE_LIGHT_SIMPLE_DESC_VA(ep_name, ep_id, in_clust_num, out_clust_num) \
    ZB_DECLARE_SIMPLE_DESC_VA(in_clust_num, out_clust_num, ep_name);                                 \
    ZB_AF_SIMPLE_DESC_TYPE_VA(in_clust_num, out_clust_num, ep_name)                                  \
    simple_desc_##ep_name =                                                                          \
        {                                                                                            \
            ep_id,                                                                                   \
            ZB_AF_HA_PROFILE_ID,                                                                     \
            ZB_HA_DIMMABLE_LIGHT_DEVICE_ID,                                                          \
            ZB_HA_DEVICE_VER_DIMMABLE_LIGHT,                                                         \
            0,                                                                                       \
            in_clust_num,                                                                            \
            out_clust_num,                                                                           \
            {                                                                                        \
                ZB_ZCL_CLUSTER_ID_BASIC,                                                             \
                ZB_ZCL_CLUSTER_ID_IDENTIFY,                                                          \
                ZB_ZCL_CLUSTER_ID_SCENES,                                                            \
                ZB_ZCL_CLUSTER_ID_GROUPS,                                                            \
                ZB_ZCL_CLUSTER_ID_ON_OFF,                                                            \
                ZB_ZCL_CLUSTER_ID_LEVEL_CONTROL,                                                     \
            }}

// макрос описывает структуру эндпоинта целиком со всеми потрохами
#define ZB_HA_DECLARE_LIGHT_EP(ep_name, ep_id, cluster_list)                                                                                    \
    ZB_ZCL_DECLARE_HA_DIMMABLE_LIGHT_SIMPLE_DESC_VA(ep_name, ep_id, ZB_HA_DIMMABLE_LIGHT_IN_CLUSTER_NUM, ZB_HA_DIMMABLE_LIGHT_OUT_CLUSTER_NUM); \
    ZBOSS_DEVICE_DECLARE_REPORTING_CTX(reporting_info##device_ctx_name, ZB_HA_DIMMABLE_LIGHT_REPORT_ATTR_COUNT);                                \
    ZBOSS_DEVICE_DECLARE_LEVEL_CONTROL_CTX(cvc_alarm_info##device_ctx_name, ZB_HA_DIMMABLE_LIGHT_CVC_ATTR_COUNT);                               \
    ZB_AF_DECLARE_ENDPOINT_DESC(ep_name, ep_id, ZB_AF_HA_PROFILE_ID,                                                                            \
        0,                                                                                                                                      \
        NULL,                                                                                                                                   \
        ZB_ZCL_ARRAY_SIZE(cluster_list, zb_zcl_cluster_desc_t),                                                                                 \
        cluster_list,                                                                                                                           \
        (zb_af_simple_desc_1_1_t *)&simple_desc_##ep_name,                                                                                      \
        ZB_HA_DIMMABLE_LIGHT_REPORT_ATTR_COUNT,                                                                                                 \
        reporting_info##device_ctx_name,                                                                                                        \
        ZB_HA_DIMMABLE_LIGHT_CVC_ATTR_COUNT,                                                                                                    \
        cvc_alarm_info##device_ctx_name)

// вспомогательный макрос, нужный в макросе ZB_DECLARE_DIMMABLE_CONTROL_CLUSTER_LIST для заполнения кластеров
#define ZB_ZCL_DECLARE_LEVEL_CONTROL_ATTRIB_LIST_VA(attr_list, current_level, remaining_time, ...) \
    zb_zcl_level_control_move_status_t move_status_data_ctx##__VA_ARGS__##_attr_list;              \
    ZB_ZCL_START_DECLARE_ATTRIB_LIST(attr_list)                                                    \
    ZB_ZCL_SET_ATTR_DESC(ZB_ZCL_ATTR_LEVEL_CONTROL_CURRENT_LEVEL_ID, (current_level))              \
    ZB_ZCL_SET_ATTR_DESC(ZB_ZCL_ATTR_LEVEL_CONTROL_REMAINING_TIME_ID, (remaining_time))            \
    ZB_ZCL_SET_ATTR_DESC(ZB_ZCL_ATTR_LEVEL_CONTROL_MOVE_STATUS_ID,                                 \
        (&(move_status_data_ctx##__VA_ARGS__##_attr_list)))                                        \
    ZB_ZCL_FINISH_DECLARE_ATTRIB_LIST

#if !defined ZB_ROUTER_ROLE
#error Define ZB_ROUTER_ROLE to compile light bulb (Router) source code.
#endif

// структуры, которые в последствии войдут в bulb_device_ctx_t. Используются в bulb_device_ctx_t, где хранится
// полное состояние эндпоинта
typedef struct
{
    zb_uint8_t zcl_version;
    zb_uint8_t app_version;
    zb_uint8_t stack_version;
    zb_uint8_t hw_version;
    zb_char_t mf_name[32];
    zb_char_t model_id[32];
    zb_char_t date_code[16];
    zb_uint8_t power_source;
    zb_char_t location_id[17];
    zb_uint8_t ph_env;
    zb_char_t sw_ver[17];
} bulb_device_basic_attr_t;

typedef struct
{
    zb_uint16_t identify_time;
} bulb_device_identify_attr_t;

typedef struct
{
    zb_bool_t on_off;
    zb_bool_t global_scene_ctrl;
    zb_uint16_t on_time;
    zb_uint16_t off_wait_time;
} bulb_device_on_off_attr_t;

typedef struct
{
    zb_uint8_t current_level;
    zb_uint16_t remaining_time;
} bulb_device_level_control_attr_t;

typedef struct
{
    zb_uint8_t scene_count;
    zb_uint8_t current_scene;
    zb_uint8_t scene_valid;
    zb_uint8_t name_support;
    zb_uint16_t current_group;
} bulb_device_scenes_attr_t;

typedef struct
{
    zb_uint8_t name_support;
} bulb_device_groups_attr_t;

typedef struct
{
    uint8_t ep_id; // айди эндпоинта (10-13)
    uint8_t pwm_channel; // используемый канал ШИМ

    bulb_device_basic_attr_t basic_attr;
    bulb_device_identify_attr_t identify_attr;
    bulb_device_scenes_attr_t scenes_attr;
    bulb_device_groups_attr_t groups_attr;
    bulb_device_on_off_attr_t on_off_attr;
    bulb_device_level_control_attr_t level_control_attr;
} bulb_device_ctx_t;

