vke/nrf52840_dimmer_rgbw_zigbee/main.c
// 4 структуры, в которых хранится полное состояние каждого из 4 эндпоинтов девайса (вкл/выкл, яркость и так далее).
static bulb_device_ctx_t m_dev_ctx_r;
static bulb_device_ctx_t m_dev_ctx_g;
static bulb_device_ctx_t m_dev_ctx_b;
static bulb_device_ctx_t m_dev_ctx_w;

// макрос, который описывает поддерживаемые эндпоинтом кластеры для управления им.
#define ZB_DECLARE_DIMMABLE_CONTROL_CLUSTER_LIST(dev_ctx_name, dimmable_light_bulb_cluster_list) \
    ZB_ZCL_DECLARE_IDENTIFY_ATTRIB_LIST(dev_ctx_name##_identify_attr_list,                       \
        &dev_ctx_name.identify_attr.identify_time);                                              \
    ZB_ZCL_DECLARE_GROUPS_ATTRIB_LIST(dev_ctx_name####_groups_attr_list,                         \
        &dev_ctx_name.groups_attr.name_support);                                                 \
    ZB_ZCL_DECLARE_SCENES_ATTRIB_LIST(dev_ctx_name##_scenes_attr_list,                           \
        &dev_ctx_name.scenes_attr.scene_count,                                                   \
        &dev_ctx_name.scenes_attr.current_scene,                                                 \
        &dev_ctx_name.scenes_attr.current_group,                                                 \
        &dev_ctx_name.scenes_attr.scene_valid,                                                   \
        &dev_ctx_name.scenes_attr.name_support);                                                 \
    ZB_ZCL_DECLARE_BASIC_ATTRIB_LIST_EXT(dev_ctx_name##_basic_attr_list,                         \
        &dev_ctx_name.basic_attr.zcl_version,                                                    \
        &dev_ctx_name.basic_attr.app_version,                                                    \
        &dev_ctx_name.basic_attr.stack_version,                                                  \
        &dev_ctx_name.basic_attr.hw_version,                                                     \
        dev_ctx_name.basic_attr.mf_name,                                                         \
        dev_ctx_name.basic_attr.model_id,                                                        \
        dev_ctx_name.basic_attr.date_code,                                                       \
        &dev_ctx_name.basic_attr.power_source,                                                   \
        dev_ctx_name.basic_attr.location_id,                                                     \
        &dev_ctx_name.basic_attr.ph_env,                                                         \
        dev_ctx_name.basic_attr.sw_ver);                                                         \
    ZB_ZCL_DECLARE_ON_OFF_ATTRIB_LIST_EXT(dev_ctx_name##_on_off_attr_list,                       \
        &dev_ctx_name.on_off_attr.on_off,                                                        \
        &dev_ctx_name.on_off_attr.global_scene_ctrl,                                             \
        &dev_ctx_name.on_off_attr.on_time,                                                       \
        &dev_ctx_name.on_off_attr.off_wait_time);                                                \
    ZB_ZCL_DECLARE_LEVEL_CONTROL_ATTRIB_LIST_VA(dev_ctx_name##_level_control_attr_list,          \
        &dev_ctx_name.level_control_attr.current_level,                                          \
        &dev_ctx_name.level_control_attr.remaining_time);                                        \
    ZB_HA_DECLARE_DIMMABLE_LIGHT_CLUSTER_LIST(dimmable_light_bulb_cluster_list,                  \
        dev_ctx_name##_basic_attr_list,                                                          \
        dev_ctx_name##_identify_attr_list,                                                       \
        dev_ctx_name##_groups_attr_list,                                                         \
        dev_ctx_name##_scenes_attr_list,                                                         \
        dev_ctx_name##_on_off_attr_list,                                                         \
        dev_ctx_name##_level_control_attr_list);

// заполняем кластеры для каждого эндпоинта
ZB_DECLARE_DIMMABLE_CONTROL_CLUSTER_LIST(m_dev_ctx_r, m_dev_clusters_r);
ZB_DECLARE_DIMMABLE_CONTROL_CLUSTER_LIST(m_dev_ctx_g, m_dev_clusters_g);
ZB_DECLARE_DIMMABLE_CONTROL_CLUSTER_LIST(m_dev_ctx_b, m_dev_clusters_b);
ZB_DECLARE_DIMMABLE_CONTROL_CLUSTER_LIST(m_dev_ctx_w, m_dev_clusters_w);

// создаём 4 эндпоинта, указываем для них айди и кластеры
ZB_HA_DECLARE_LIGHT_EP(dimmable_light_ep_r, HA_DIMMABLE_LIGHT_ENDPOINT_R, m_dev_clusters_r);
ZB_HA_DECLARE_LIGHT_EP(dimmable_light_ep_g, HA_DIMMABLE_LIGHT_ENDPOINT_G, m_dev_clusters_g);
ZB_HA_DECLARE_LIGHT_EP(dimmable_light_ep_b, HA_DIMMABLE_LIGHT_ENDPOINT_B, m_dev_clusters_b);
ZB_HA_DECLARE_LIGHT_EP(dimmable_light_ep_w, HA_DIMMABLE_LIGHT_ENDPOINT_W, m_dev_clusters_w);

// полный список эндпоинтов, dimmable_light_ctx используется в ZB_AF_REGISTER_DEVICE_CTX() для регистрации
ZBOSS_DECLARE_DEVICE_CTX_EP_VA(dimmable_light_ctx, &dimmable_light_ep_r, &dimmable_light_ep_g, &dimmable_light_ep_b, &dimmable_light_ep_w);

// поиск контекста эндпоинта (где все настройки и состояние) по его айди. Эндпоинты с 10 по 13 для каждого цвета соответственно
bulb_device_ctx_t *find_ctx_by_ep_id(zb_uint8_t ep)
{
    if (ep == HA_DIMMABLE_LIGHT_ENDPOINT_R)
        return &m_dev_ctx_r;
    else if (ep == HA_DIMMABLE_LIGHT_ENDPOINT_G)
        return &m_dev_ctx_g;
    else if (ep == HA_DIMMABLE_LIGHT_ENDPOINT_B)
        return &m_dev_ctx_b;
    else if (ep == HA_DIMMABLE_LIGHT_ENDPOINT_W)
        return &m_dev_ctx_w;
    return NULL;
}

// инициализация таймеров
static void timer_init(void)
{
    uint32_t error_code = app_timer_init();
    APP_ERROR_CHECK(error_code);
}

// инициализация логгирования в уарт.
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}

// функция прописывает яркость эндпоинта в нужном канале ШИМ
static void pwm_set_brightness(bulb_device_ctx_t *p_dimmable_light_ctx, zb_uint16_t brightness)
{
    uint16_t *p_channels = (uint16_t *)&m_led_values;

    p_channels[p_dimmable_light_ctx->pwm_channel] = brightness;
}

